In [1]:
import pandas as pd

In [4]:
filepath="DataFiles/data.xlsx"
df=pd.read_excel(filepath)

In [5]:
df

       name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000

In [6]:
df.groupby("department")

In [7]:
df.groupby("department")["salary"].mean